---
title: RebarShapeMultiplanarDefinition
classe: Autodesk.Revit.DB.Structure.RebarShapeMultiplanarDefinition
namespace: Autodesk.Revit.DB.Structure
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 8
---

# RebarShapeMultiplanarDefinition

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `ElementId DepthParamId { get; set; }` | `rebarShapeMultiplanarDefinition.DepthParamId` | ElementId |
| `Boolean IsDuplicateShapePresent { get; }` | `rebarShapeMultiplanarDefinition.IsDuplicateShapePresent` | Boolean |
| `Boolean IsEndConnectorPresent { get; }` | `rebarShapeMultiplanarDefinition.IsEndConnectorPresent` | Boolean |
| `Boolean IsStartConnectorPresent { get; }` | `rebarShapeMultiplanarDefinition.IsStartConnectorPresent` | Boolean |
| `Boolean IsValidObject { get; }` | `rebarShapeMultiplanarDefinition.IsValidObject` | Boolean |
| `Double OutOfPlaneBendDiameter { get; set; }` | `rebarShapeMultiplanarDefinition.OutOfPlaneBendDiameter` | Double |
| `Void Dispose()` | `rebarShapeMultiplanarDefinition.Dispose()` | Void |
| `Void SetPresenceOfSegments(Boolean, Boolean, Boolean)` | `rebarShapeMultiplanarDefinition.SetPresenceOfSegments(isDuplicateShapePresent, isStartConnectorPresent, isEndConnectorPresent)` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```